tests/results/spark/ab_size10737418240_conc1.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ingest
Document Length:        517 bytes

Concurrency Level:      1
Time taken for tests:   4424.745 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      755000 bytes
Total body sent:        10737418398000
HTML transferred:       517000 bytes
Requests per second:    0.23 [#/sec] (mean)
Time per request:       4424.745 [ms] (mean)
Time per request:       4424.745 [ms] (mean, across all concurrent requests)
Transfer rate:          0.17 [Kbytes/sec] received
                        2369799.81 kb/s sent
                        2369799.98 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:  3186 4425 829.0   4190    6364
Waiting:        0    0   1.2      0       6
Total:       3186 4425 829.0   4190    6364

Percentage of the requests served within a certain time (ms)
  50%   4190
  66%   4670
  75%   5010
  80%   5271
  90%   5804
  95%   5996
  98%   6132
  99%   6185
 100%   6364 (longest request)