tests/results/spark/ab_size1073741824_conc1.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /ingest
Document Length:        517 bytes

Concurrency Level:      1
Time taken for tests:   466.902 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      755000 bytes
Total body sent:        1073741981000
HTML transferred:       517000 bytes
Requests per second:    2.14 [#/sec] (mean)
Time per request:       466.902 [ms] (mean)
Time per request:       466.902 [ms] (mean, across all concurrent requests)
Transfer rate:          1.58 [Kbytes/sec] received
                        2245816.22 kb/s sent
                        2245817.80 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   313  467 110.1    423     686
Waiting:        0    1   2.1      0      17
Total:        313  467 110.1    423     686

Percentage of the requests served within a certain time (ms)
  50%    423
  66%    533
  75%    591
  80%    607
  90%    627
  95%    633
  98%    639
  99%    644
 100%    686 (longest request)